Revit 2024 API
IFCExtrusionCalculatorOptions Members
The IFCExtrusionCalculatorOptions type exposes the following members.
Constructors
Name | Description
IFCExtrusionCalculatorOptions
 Constructs a new instance of a class used to calculate extrusions from Revit geometry.
Methods
Name | Description
Dispose
Releases all resources used by the IFCExtrusionCalculatorOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CustomAxis
 The custom axis to try (if extrusionAxes includes an option for a custom direction).
ExtrusionAxes
 The extrusion axes to try when doing the calculation.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Scale
 The scaling factor for length measurements from the default Revit units to the export units.
See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace